andrade824/STM32F7-Drivers/configs/stm32f7/stm32f746_disco_config.h
/**
 * @author Devon Andrade
 * @created 12/6/2018
 *
 * Platform-specific definitions relating to the STM32F746 microcontroller
 * and the STM32F746 Discovery board.
 */
#ifndef STM32F746_DISCO_CONFIG_H
#define STM32F746_DISCO_CONFIG_H

#include <stdint.h>

/***** CLOCK SETTINGS *****/

/**
 * Clock settings. The user needs to ensure that init_clocks() in "system.c"
 * generates clocks with these frequencies.
 */
#define CPU_HZ 216000000
#define APB2_HZ 108000000
#define APB1_HZ 54000000
#define AHB_HZ CPU_HZ
#define FLASH_WAIT_STATES 7

/**
 * PLL and bus divider settings used to get the clock values above.
 *
 * CPU_HZ = (fInput * (PLLN / PLLM)) / PLLP
 * AHB_HZ = CPU_HZ
 * APB2_HZ = AHB_HZ / APB2_DIV
 * APB1_HZ = AHB_HZ / APB1_DIV
 */
#define CLK_PLLQ 4
#define CLK_PLLM 25
#define CLK_PLLN 432
#define CLK_PLLP 0        /* Divide by 2 */

#define CLK_APB1_DIV 5    /* Divide by 4 */
#define CLK_APB2_DIV 4    /* Divide by 2 */

/**
 * Clock settings used for the LCD pixel clock.
 *
 * PLLSAI = fInput * (PLLSAIN / PLLM)
 * PLLSAIR = PLLSAI / PLLSAIR
 * Pixel Clock = PLLSAIR / PLLSAIDIVR
 *
 * Pixel Clock = ((25MHz * (192 / 25)) / 5) / 4 = 9.6MHz
 */
#define CLK_PLLSAI_PLLN 192
#define CLK_PLLSAIR     5
#define CLK_PLLSAIDIVR  1 /* Divide by 4 */

/***** GPIO CONFIGURATION *****/

/**
 * Ensure that the GPIO_Pxy macros have been defined before the following
 * macros.
 */
#include "gpio.h"

/**
 * Aliases to the GPIO_Pxy macros for the I/O pins on the STM32F7
 * discovery board.
 */
#define GPIO_ARD_A0                 GPIO_PA0
#define GPIO_RMII_REF_CLK           GPIO_PA1
#define GPIO_RMII_MDIO              GPIO_PA2
#define GPIO_ULPI_D0                GPIO_PA3
#define GPIO_DCMI_HSYNC             GPIO_PA4
#define GPIO_ULPI_CK                GPIO_PA5
#define GPIO_DCMI_PIXCK             GPIO_PA6
#define GPIO_RMII_CRS_DV            GPIO_PA7
#define GPIO_ARD_D10                GPIO_PA8
#define GPIO_VCP_TX                 GPIO_PA9
#define GPIO_OTG_FS_ID              GPIO_PA10
#define GPIO_OTG_FS_N               GPIO_PA11
#define GPIO_OTG_FS_P               GPIO_PA12
#define GPIO_SWDIO                  GPIO_PA13
#define GPIO_SWCLK                  GPIO_PA14
#define GPIO_ARD_D9                 GPIO_PA15

#define GPIO_ULPI_D1                GPIO_PB0
#define GPIO_ULPI_D2                GPIO_PB1
#define GPIO_QSPI_CLK               GPIO_PB2
#define GPIO_SWO                    GPIO_PB3
#define GPIO_ARD_D3                 GPIO_PB4
#define GPIO_ULPI_D7                GPIO_PB5
#define GPIO_QSPI_NCS               GPIO_PB6
#define GPIO_VCP_RX                 GPIO_PB7
#define GPIO_DCMI_SCL               GPIO_PB8
#define GPIO_DCMI_SDA               GPIO_PB9
#define GPIO_ULPI_D3                GPIO_PB10
#define GPIO_ULPI_D4                GPIO_PB11
#define GPIO_ULPI_D5                GPIO_PB12
#define GPIO_ULIP_D6                GPIO_PB13
#define GPIO_ARD_D12                GPIO_PB14
#define GPIO_ARD_D11                GPIO_PB15

#define GPIO_ULPI_STP               GPIO_PC0
#define GPIO_RMII_MDC               GPIO_PC1
#define GPIO_ULPI_DIR               GPIO_PC2
#define GPIO_FMC_SDCKE0             GPIO_PC3
#define GPIO_RMII_RXD0              GPIO_PC4
#define GPIO_RMII_RXD1              GPIO_PC5
#define GPIO_ARD_D1                 GPIO_PC6
#define GPIO_ARD_D0                 GPIO_PC7
#define GPIO_USD_D0                 GPIO_PC8
#define GPIO_USD_D1                 GPIO_PC9
#define GPIO_USD_D2                 GPIO_PC10
#define GPIO_USD_D3                 GPIO_PC11
#define GPIO_USD_CLK                GPIO_PC12
#define GPIO_USD_DETECT             GPIO_PC13
#define GPIO_OSC32_IN               GPIO_PC14
#define GPIO_OSC32_OUT              GPIO_PC15

#define GPIO_FMC_D2                 GPIO_PD0
#define GPIO_FMC_D3                 GPIO_PD1
#define GPIO_USD_CMD                GPIO_PD2
#define GPIO_DCMI_D5                GPIO_PD3
#define GPIO_OTG_FS_OVERCURRENT     GPIO_PD4
#define GPIO_OTG_FS_POWERSWITCHON   GPIO_PD5
#define GPIO_AUDIO_INT              GPIO_PD6
#define GPIO_SPDIF_RX0              GPIO_PD7
#define GPIO_FMC_D13                GPIO_PD8
#define GPIO_FMC_D14                GPIO_PD9
#define GPIO_FMC_D15                GPIO_PD10
#define GPIO_QSPI_D0                GPIO_PD11
#define GPIO_QSPI_D1                GPIO_PD12
#define GPIO_QSPI_D3                GPIO_PD13
#define GPIO_FMC_D0                 GPIO_PD14
#define GPIO_FMC_D1                 GPIO_PD15

#define GPIO_FMC_NBL0               GPIO_PE0
#define GPIO_FMC_NBL1               GPIO_PE1
#define GPIO_QSPI_D2                GPIO_PE2
#define GPIO_OTG_HS_OVERCURRENT     GPIO_PE3
#define GPIO_LCD_B0                 GPIO_PE4
#define GPIO_DCMI_D6                GPIO_PE5
#define GPIO_DCMI_D7                GPIO_PE6
#define GPIO_FMC_D4                 GPIO_PE7
#define GPIO_FMC_D5                 GPIO_PE8
#define GPIO_FMC_D6                 GPIO_PE9
#define GPIO_FMC_D7                 GPIO_PE10
#define GPIO_FMC_D8                 GPIO_PE11
#define GPIO_FMC_D9                 GPIO_PE12
#define GPIO_FMC_D10                GPIO_PE13
#define GPIO_FMC_D11                GPIO_PE14
#define GPIO_FMC_D12                GPIO_PE15

#define GPIO_FMC_A0                 GPIO_PF0
#define GPIO_FMC_A1                 GPIO_PF1
#define GPIO_FMC_A2                 GPIO_PF2
#define GPIO_FMC_A3                 GPIO_PF3
#define GPIO_FMC_A4                 GPIO_PF4
#define GPIO_FMC_A5                 GPIO_PF5
#define GPIO_ARD_A5                 GPIO_PF6
#define GPIO_ARD_A4                 GPIO_PF7
#define GPIO_ARD_A3                 GPIO_PF8
#define GPIO_ARD_A2                 GPIO_PF9
#define GPIO_ARD_A1                 GPIO_PF10
#define GPIO_FMC_SDNRAS             GPIO_PF11
#define GPIO_FMC_A6                 GPIO_PF12
#define GPIO_FMC_A7                 GPIO_PF13
#define GPIO_FMC_A8                 GPIO_PF14
#define GPIO_FMC_A9                 GPIO_PF15

#define GPIO_FMC_A10                GPIO_PG0
#define GPIO_FMC_A11                GPIO_PG1
#define GPIO_RMII_RXER              GPIO_PG2
#define GPIO_EXT_RST                GPIO_PG3
#define GPIO_FMC_BA0                GPIO_PG4
#define GPIO_FMC_BA1                GPIO_PG5
#define GPIO_ARD_D2                 GPIO_PG6
#define GPIO_ARD_D4                 GPIO_PG7
#define GPIO_FMC_SDCLK              GPIO_PG8
#define GPIO_DCMI_VSYNC             GPIO_PG9
#define GPIO_SAI2_SDB               GPIO_PG10
#define GPIO_RMII_TX_EN             GPIO_PG11
#define GPIO_LCD_B4                 GPIO_PG12
#define GPIO_RMII_TXD0              GPIO_PG13
#define GPIO_RMII_TXD1              GPIO_PG14
#define GPIO_FMC_SDNCAS             GPIO_PG15

#define GPIO_OSC_IN                 GPIO_PH0
#define GPIO_OSC_OUT                GPIO_PH1
#define GPIO_NC2                    GPIO_PH2
#define GPIO_FMC_SDNE0              GPIO_PH3
#define GPIO_ULPI_NXT               GPIO_PH4
#define GPIO_FMC_SDNWE              GPIO_PH5
#define GPIO_ARD_D6                 GPIO_PH6
#define GPIO_LCD_SCL                GPIO_PH7
#define GPIO_LCD_SDA                GPIO_PH8
#define GPIO_DCMI_D0                GPIO_PH9
#define GPIO_DCMI_D1                GPIO_PH10
#define GPIO_DCMI_D2                GPIO_PH11
#define GPIO_DCMI_D3                GPIO_PH12
#define GPIO_DCMI_PWR_EN            GPIO_PH13
#define GPIO_DCMI_D4                GPIO_PH14
#define GPIO_TP_PH15                GPIO_PH15

#define GPIO_ARD_D5                 GPIO_PI0
#define GPIO_ARD_D13                GPIO_PI1
#define GPIO_ARD_D8                 GPIO_PI2
#define GPIO_ARD_D7                 GPIO_PI3
#define GPIO_SAI2_MCLKA             GPIO_PI4
#define GPIO_SAI2_SCKA              GPIO_PI5
#define GPIO_SAI2_SDA               GPIO_PI6
#define GPIO_SAI2_FSA               GPIO_PI7
#define GPIO_NC1                    GPIO_PI8
#define GPIO_LCD_VSYNC              GPIO_PI9
#define GPIO_LCD_HSYNC              GPIO_PI10
#define GPIO_B_USER                 GPIO_PI11
#define GPIO_LCD_DISP               GPIO_PI12
#define GPIO_LCD_INT                GPIO_PI13
#define GPIO_LCD_CLK                GPIO_PI14
#define GPIO_LCD_R0                 GPIO_PI15

#define GPIO_LCD_R1                 GPIO_PJ0
#define GPIO_LCD_R2                 GPIO_PJ1
#define GPIO_LCD_R3                 GPIO_PJ2
#define GPIO_LCD_R4                 GPIO_PJ3
#define GPIO_LCD_R5                 GPIO_PJ4
#define GPIO_LCD_R6                 GPIO_PJ5
#define GPIO_LCD_R7                 GPIO_PJ6
#define GPIO_LCD_G0                 GPIO_PJ7
#define GPIO_LCD_G1                 GPIO_PJ8
#define GPIO_LCD_G2                 GPIO_PJ9
#define GPIO_LCD_G3                 GPIO_PJ10
#define GPIO_LCD_G4                 GPIO_PJ11
#define GPIO_OTG_FS_VBUS            GPIO_PJ12
#define GPIO_LCD_B1                 GPIO_PJ13
#define GPIO_LCD_B2                 GPIO_PJ14
#define GPIO_LCD_B3                 GPIO_PJ15

#define GPIO_LCD_G5                 GPIO_PK0
#define GPIO_LCD_G6                 GPIO_PK1
#define GPIO_LCD_G7                 GPIO_PK2
#define GPIO_LCD_BL_CTRL            GPIO_PK3
#define GPIO_LCD_B5                 GPIO_PK4
#define GPIO_LCD_B6                 GPIO_PK5
#define GPIO_LCD_B7                 GPIO_PK6
#define GPIO_LCD_DE                 GPIO_PK7

/***** INTERRUPT CONFIGURATION *****/

/**
 * The start address of the vector table. This is located in tightly coupled
 * instruction RAM.
 */
#define VECTOR_TABLE_ADDR 0x0

/**
 * Interrupt Request Numbers.
 *
 * The CMSIS interrupt methods assume that the exception values are negative
 * and that the STM32 specific interrupts are positive (starting at zero).
 *
 * To use the IRQ values as indices into the vector table, the vector table
 * will need to point to vector 0 (the vector for "WWDG_IRQn"). This way, the
 * negative indices will correctly be evaluated.
 */
typedef enum
{
	IRQ_START                   = -15,

