andrade824/STM32F7-Drivers/configs/stm32f7/stm32f746_disco_config.h
/* SDRAM Command Mode Register settings */
#define SDCMR_CTB1 0x1  /* Only perform commands on the first bank */
#define SDCMR_CTB2 0x0
#define SDCMR_NRFS 0x7  /* Send 8 Auto-Refresh commands */
#define SDCMR_MRD 0x220 /* CAS Latency = 2 cycles, Write Burst = Single */

/**
 * Refresh Timer Register [13.7.5]
 *
 * The datasheet is a little confusing as to how to compute this value. By
 * reverse engineering their example, this is the equation I've come up with:
 *
 * SDRTR = (((Refresh Rate) / (Number of Rows)) * (SDRAM Clock Frequency)) - 20
 *
 * The refresh rate must be increased by 20 SDRAM clock cycles to obtain a safe
 * margin if an internal refresh occurs when a read request has been accepted.
 *
 * For this device:
 * SDRTR = ((64ms / 4096 rows) * 108MHz) - 20 = TRUNCATE(1667.5) = 1667
 */
#define SDRTR_COUNT 1667

#endif /* INCLUDE_SDRAM_DRIVER */

/***** LCD TIMING CONFIGURATION *****/

#ifdef INCLUDE_LCD_CTRL_DRIVER

/* Required for polarity declarations. */
#include "lcd_ctrl.h"

/* Timings and settings used for the LCD on the STM32F7 Discovery board. */
#define LCD_CONFIG_HSYNC      1U
#define LCD_CONFIG_VSYNC      1U
#define LCD_CONFIG_HORIZ_BP   43U
#define LCD_CONFIG_VERT_BP    12U
#define LCD_CONFIG_WIDTH      480U
#define LCD_CONFIG_HEIGHT     272U
#define LCD_CONFIG_HORIZ_FP   8U
#define LCD_CONFIG_VERT_FP    4U
#define LCD_CONFIG_HSYNC_POL  ACTIVE_LOW
#define LCD_CONFIG_VSYNC_POL  ACTIVE_LOW
#define LCD_CONFIG_DE_POL     ACTIVE_LOW
#define LCD_CONFIG_CLK_POL    ACTIVE_LOW

#define LCD_CONFIG_PIXEL_FORMAT PF_RGB565

#if LCD_CONFIG_PIXEL_FORMAT == PF_ARGB8888
#define LCD_CONFIG_PIXEL_SIZE 4U
typedef uint32_t pixel_t;
#elif LCD_CONFIG_PIXEL_FORMAT == PF_RGB565
#define LCD_CONFIG_PIXEL_SIZE 2U
typedef uint16_t pixel_t;
#else
#error Unsupported pixel format selected.
#endif /* LCD_CONFIG_PIXEL_FORMAT */

#endif /* INCLUDE_LCD_CTRL_DRIVER */

/***** FONT CONFIGURATION *****/
#ifdef INCLUDE_FONT_TABLE

/* The size of the wanted font in points (check font.h for supported sizes). */
#define FONT_CONFIG 9

#endif /* INCLUDE_FONT_TABLE */

/***** INCLUDE GENERIC STM32F7 CONFIGURATION *****/

/**
 * This needs to be included after IRQn_Type is defined as that is needed by
 * the included CMSIS header file.
 */
#include "stm32f7_generic.h"

#endif /* STM32F746_DISCO_CONFIG_H */
